#ifndef DISTANCECOEFFS_H_
#define DISTANCECOEFFS_H_

#include "../myheader.h"

#define DIST_CORR_MAX_LENS   16  /* Lens_Set 最大值 */
#define DIST_CORR_MAX_DIST   32  /* 0~15 m */


/** @note 一档（Usermenu_SW == 1，9.1mm 镜头） */
static const ts_f32 tempMode1_lens_9p1mm[DIST_CORR_MAX_DIST] = {
    0.9875f, 0.9875f, 1.0000f, 1.0150f,
    1.0217f, 1.0288f, 1.0288f, 1.0373f,
    1.0400f, 1.0500f, 1.0590f, 1.0650f,
    1.0729f, 1.0830f, 1.0924f, 1.0980f,
	/* 高温，一挡高温距离修正系数配置为1 */
	1.0000f, 1.0000f, 1.0000f, 1.0000f,
	1.0000f, 1.0000f, 1.0000f, 1.0000f,
	1.0000f, 1.0000f, 1.0000f, 1.0000f,
	1.0000f, 1.0000f, 1.0000f, 1.0000f
};
/** @note 二档（Usermenu_SW == 2，9.1mm 镜头） */
static const ts_f32 tempMode2_lens_9p1mm[DIST_CORR_MAX_DIST] = {
    0.9920f, 0.9920f, 1.0060f, 1.0200f,
    1.0320f, 1.0510f, 1.0560f, 1.0610f,
    1.0680f, 1.0770f, 1.0830f, 1.0890f,
    1.0980f, 1.1090f, 1.1120f, 1.1250f,
	/* 高温，一挡高温距离修正系数 */
    0.9920f, 0.9920f, 1.0250f, 1.0500f,
    1.0630f, 1.0760f, 1.0820f, 1.0900f,
    1.1000f, 1.1150f, 1.1250f, 1.1310f,
    1.1390f, 1.1520f, 1.1620f, 1.1800f
};
 //千从项目
/** @note 一档（Usermenu_SW == 1，9.1mm 镜头） */
static const ts_f32 tempMode1_lens_9p1mm_QC[DIST_CORR_MAX_DIST] = {
    0.9870f, 0.9700f, 0.9800f, 0.9870f,
    1.0000f, 1.0100f, 1.0200f, 1.0200f,
    1.0300f, 1.0380f, 1.0450f, 1.0500f,
    1.0600f, 1.0700f, 1.0800f, 1.0870f,
	/* 高温，一挡高温距离修正系数配置为1 */
	1.0000f, 1.0000f, 1.0000f, 1.0000f,
	1.0000f, 1.0000f, 1.0000f, 1.0000f,
	1.0000f, 1.0000f, 1.0000f, 1.0000f,
	1.0000f, 1.0000f, 1.0000f, 1.0000f
};
/** @note 二档（Usermenu_SW == 2，9.1mm 镜头） */
static const ts_f32 tempMode2_lens_9p1mm_QC[DIST_CORR_MAX_DIST] = {
    0.9880f, 0.9687f, 0.9873f, 0.9880f,
	0.9873f, 1.0195f, 1.0050f, 1.0429f,
	1.0330f, 1.0618f, 1.0740f, 1.0822f,
	1.0873f, 1.0974f, 1.1060f, 1.1183f,
	/* 高温，一挡高温距离修正系数 */
   	0.9880f, 0.9400f, 0.9600f, 0.9880f,
	1.0080f, 1.0300f, 1.0480f, 1.0700f,
	1.0900f, 1.1000f, 1.1200f, 1.1300f,
	1.1500f, 1.1600f, 1.1700f, 1.1900f
};



#endif /* DISTANCECOEFFS_H_ */